{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping five application features (upload, transform, filters, adjustments, export) to their implementing source files and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of every frontend source file, serving as a reference index for the photo editor's components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including backgrounds, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Photo Editor' that mounts the React app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that renders EditorPage as the sole page of the single-page application.",
  "frontend/src/components/AdjustmentsPanel.tsx": "Right-panel component rendering four labeled sliders (brightness, contrast, saturation, sharpness) ranging from -100 to +100 with a reset button and active-state highlighting.",
  "frontend/src/components/CropTool.tsx": "Interactive crop overlay component with draggable corner, edge, and move handles that converts display-coordinate crop selections to full-resolution image coordinates on apply.",
  "frontend/src/components/ExportButton.tsx": "Button component that triggers a PNG export action and displays a loading spinner while the export is in progress.",
  "frontend/src/components/FilterStrip.tsx": "Horizontally scrollable strip of filter thumbnail buttons that previews each filter preset on the uploaded image and highlights the active selection.",
  "frontend/src/components/ImageCanvas.tsx": "Canvas component that redraws the uploaded image with all transformations and CSS filters applied whenever its props change.",
  "frontend/src/components/TransformToolbar.tsx": "Renders a vertical toolbar with buttons for rotate, flip, crop toggle, and reset transform operations, using tooltips for each action.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdjustments.ts": "Custom hook managing image adjustment state (brightness, contrast, etc.) with setAdjustment and resetAdjustments helpers.",
  "frontend/src/hooks/useFilters.ts": "Custom hook managing the active filter preset selection, exposing the filter list, active filter, and select/reset functions.",
  "frontend/src/hooks/useImageExport.ts": "Custom hook that exports the edited image as a PNG blob and triggers a browser download, tracking export loading state.",
  "frontend/src/hooks/useImageTransform.ts": "Custom hook managing image transform state (rotation, flip, crop) with individual action callbacks and a full reset.",
  "frontend/src/hooks/useImageUpload.ts": "Custom hook handling image file upload via file input or drag-and-drop, loading the image into an HTMLImageElement and exposing state for the loaded image, loading status, and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed since the photo editor operates entirely client-side.",
  "frontend/src/index.css": "Global CSS file defining a dark photo-editor theme using Tailwind and OKLCH CSS custom properties, plus custom scrollbar and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/EditorPage.tsx": "Main editor page component composing image upload, canvas display, transform toolbar, crop tool, filter strip, adjustments panel, and export button into a full photo editor UI.",
  "frontend/src/utils/adjustmentFilters.ts": "Defines the Adjustments interface and default values, and provides functions to convert adjustment slider values (-100 to +100) into CSS filter strings and combine them with preset filters.",
  "frontend/src/utils/canvasTransform.ts": "Defines TransformState and CropRect interfaces, and provides functions to draw a transformed (rotated, flipped, cropped) image with CSS filters onto a canvas and export the result as a PNG blob.",
  "frontend/src/utils/filterPresets.ts": "Defines the FilterPreset interface and exports an array of nine named CSS filter presets (e.g., Vivid, B&W, Sepia, Warm) for one-click photo effects.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom dark-editor colors, teal/amber accents, typography, border radius, box shadows, and animation keyframes, with plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state including version, feature list, architectural notes, and pending feature requests for a dark-themed Android photo editing app with crop, filters, adjustments, and PNG export capabilities."
}