{
  "kind": "build_request",
  "title": "Photo Editing Web App",
  "projectName": "PixelCraft Editor",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Build a photo editing application where users can upload a photo from their device and see it displayed in a central canvas/preview area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Photo edit apk high quality apk create"
        ]
      },
      "acceptanceCriteria": [
        "User can click an upload button to select an image from their device",
        "Selected image is displayed in a prominent preview canvas",
        "Supported formats include JPG, PNG, and WebP"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement core photo transformation tools: crop (with draggable handles), rotate (90° clockwise/counter-clockwise), and flip (horizontal/vertical).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Photo edit apk high quality apk create"
        ]
      },
      "acceptanceCriteria": [
        "Crop tool renders a resizable selection box over the image",
        "Rotate buttons rotate the image by 90° increments",
        "Flip buttons mirror the image horizontally and vertically",
        "All transformations update the canvas preview in real-time"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a set of one-click photo filters/effects (e.g., Vivid, B&W, Sepia, Warm, Cool, Fade, Sharpen) that are applied via CSS/Canvas filters to the preview image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Photo edit apk high quality apk create"
        ]
      },
      "acceptanceCriteria": [
        "At least 7 filter presets are displayed as thumbnail previews below the canvas",
        "Clicking a filter applies it instantly to the main canvas preview",
        "Active filter is visually highlighted",
        "A 'None' / original option is available to reset filters"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add adjustment sliders for brightness, contrast, saturation, and sharpness that modify the image in real-time as the user drags each slider.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Photo edit apk high quality apk create"
        ]
      },
      "acceptanceCriteria": [
        "Four labeled sliders are displayed in an adjustments panel",
        "Each slider ranges from -100 to +100 with 0 as the default center",
        "Canvas preview updates live as sliders are moved",
        "A 'Reset Adjustments' button resets all sliders to 0"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement a high-quality image export feature that renders all applied edits (transformations, filters, adjustments) onto a Canvas element and downloads the result as a PNG file at the original image resolution.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "high quality apk create"
        ]
      },
      "acceptanceCriteria": [
        "A clearly labeled 'Download' or 'Export' button is present",
        "Clicking it triggers a browser download of the edited image as a PNG",
        "Exported image resolution matches the original uploaded image dimensions",
        "All active filters, adjustments, and transformations are baked into the exported file"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Design a sleek, dark-mode photo editor UI with a deep charcoal/slate color palette, crisp white typography, and vibrant accent highlights. Layout should follow a professional editor pattern: top toolbar, central canvas, left/right side panels for tools and adjustments, and a bottom filter strip.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "App uses a dark background (e.g., #1a1a2e or similar dark charcoal)",
        "Tool icons and labels are clearly legible in white/light grey",
        "Active tools and selected filters use a vivid accent color (e.g., teal or amber)",
        "Layout has distinct zones: toolbar, canvas, tools panel, adjustments panel, and filter strip",
        "The overall aesthetic feels professional and modern, comparable to a mobile photo editor"
      ]
    }
  ],
  "constraints": [
    "All image processing must happen client-side in the browser using Canvas API and CSS filters — no image data should be sent to the backend",
    "Do not use any external image processing libraries that require server-side execution",
    "Backend should remain minimal; no image storage in the canister"
  ],
  "nonGoals": [
    "Native Android APK packaging — this is a web application",
    "Cloud storage or saving edits to a backend database",
    "Real-time collaboration or sharing features",
    "AI-powered auto-enhancement or background removal",
    "Video editing"
  ],
  "imageRequirements": {
    "required": [
      "Dark-themed photo editor app logo mark — abstract camera aperture or lens icon with teal and amber gradient accents on a dark background (pixelcraft-logo.dim_256x256.png)",
      "Placeholder/sample photo for the editor canvas default state — a vibrant landscape photo with rich colors (sample-photo.dim_1200x800.png)"
    ],
    "edits": []
  }
}